# RebarShapeConstraintCircumference Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraintCircumference Class
Members See Also
---
A circumference constraint associated with an arc in a RebarShapeDefinition.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class RebarShapeConstraintCircumference : RebarShapeConstraint
```

Visual Basic
---
```text
Public Class RebarShapeConstraintCircumference _
	Inherits RebarShapeConstraint
```

Visual C++
---
```text
public ref class RebarShapeConstraintCircumference : public RebarShapeConstraint
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarShapeConstraint Autodesk.Revit.DB.Structure..::..RebarShapeConstraintCircumference
# See Also
RebarShapeConstraintCircumference Members
Autodesk.Revit.DB.Structure Namespace